alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4100.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--/*****************************************************************************
 *
 * Copyright (C) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use with
 * Infineon's microcontrollers.  This file can be freely distributed within 
 * development tools that are supporting such microcontrollers. 
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************-->
<!-- edited with XMLSpy v2013 sp1 (http://www.altova.com) by XMLSpy 2014 Professional Ed. Release 2, Installed for 180 users (with SMP from 2014-10-06 to 2016-10-06) (Infineon Technologies AG) -->
<!--Version of used XSLT processor: 1 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.8-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.2-->
<!--Release Notes
-->
<!--V1.6.0
- Formal update to match latest reference manual version number
- No register changes occured
-->
<!--Release History
-->
<!--V1.5.3
- Removed bit field OSCULSTAT from SCU register MIRRSTS
- Removed bit fields OSCULSTAT and HDSTAT from SCU registers SRSTAT, SRRAW, SRMSK, SRCLR, SRSET
- Removed wrongly included ETH0_0 interrupt request
-->
<!--V1.5.2

Changes versus V1.5.1
- Switch to SVD scheme V1.2
- Corrected CAN block size to 0x200
- Corrected CAN_NODEx block sizes to 0x100
- Corrected VADC block size to 0x400
- Corrected CCU4x block sizes to 0x100
- Corrected CCU8x block sizes to 0x100
- Removed enumeration type from CLK_PS bit field of LEDTS GLOBCTL register
- Added service request information to "interrupt" elements
-->
<!--V1.5.1

Changes versus V1.5.0
- Replaced binary number identifiers (0b) by (#)
- Corrected FCE address block size 0x1D to 0x20
- Added register LPACTH1
- Added bit field LPACTH1 to registers SRSTAT, SRRAW, SRMSK, SRCLR, SRSET, MIRRSTS
- Added bit field SLPHSEL to PCR (SSC-Mode) register of USIC
-->
<!--V1.5.0 - is the first version for Reference Manual V1.5

Release of V1.4 has been skipped

Changes versus V1.3.0
- Completed missing bit field enumerations in CCU4.CC4xINS and CCU8.CC8yINS registers
- Added PCx bit field enumerations in all PORTy.IOCRz registers
- Added PDx bit field enumerations in all PORTy.PDRz registers
- Removed "Reserved" bit fields
- Removed "Reserved" enumeration values
- Added attribute <readAction>modifyExternal</readAction> to registers where debugger read access can cause side effects:
  => USB registers GRXSTSP, DIEPDMA, DOEPDMA
  => USIC registers OUTR, RBUF (debugger use OUTDR, RBUFD)
  => VADC registers GLOBRES, RES (debugger use GLOBRESD, RESD)
  => CCU4 registers C0V, C1V, C2V, C3V, ECRD
  => CCU8 registers C0V, C1V, C2V, C3V, ECRD
-->
<!--Differences to Reference Manual

- Extended grouping not existing in RM for following units:
  GPDMA -> GPDMA, GPDMA_CH
  FCE -> FCE, FCE_KE
  SCU -> many sub-groups
  USB -> USB, USB_EP, USB_NODE
  CAN -> CAN, CAN_NODE, CAN_MO
  VADC -> VADC, VADC_G
  CCU4 -> CCU4, CCU4_CC4
  CCU8 -> CCU8, CCU8_CC8
  HRPWM0 -> HRPWM0, HRPWM0_CSG, HRPWM0_HRC
- CAN registers MOCTR/MOSTAT and LIST reset values removed and masked out
-->
<!--Compliance

- CMSIS-SVD V1.2
- Tested with ARM CMSIS-SVD SVD Consistency Checker / Header File Generator V2.87l (lowercase L)
-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.2-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.2" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD.xsd">
	<vendor>Infineon</vendor>
	<name>XMC4100</name>
	<version>1.5.3 (Reference Manual v1.5)</version>
	<description>SVD file</description>
	<cpu>
		<name>CM4</name>
		<revision>r2p0</revision>
		<endian>little</endian>
		<mpuPresent>true</mpuPresent>
		<fpuPresent>true</fpuPresent>
		<nvicPrioBits>6</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>PPB</name>
			<description>Cortex-M4 Private Peripheral Block</description>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ACTLR</name>
					<description>Auxiliary Control Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DISMCYCINT</name>
							<description>Disable load/store multiple</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISDEFWBUF</name>
							<description>Disable write buffer</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISFOLD</name>
							<description>Disable IT folding</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISFPCA</name>
							<description>Disable FPCA update</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISOOFP</name>
							<description>Disable out of order FP execution</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CSR</name>
					<description>SysTick Control and Status Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000004</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>counter disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>counter enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICKINT</name>
							<description>Tick Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>counting down to zero does not assert the SysTick exception request</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>counting down to zero to asserts the SysTick exception request.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSOURCE</name>
							<description>Indicates the clock source:</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>external clock</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>processor clock.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUNTFLAG</name>
							<description>Counter Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_RVR</name>
					<description>SysTick Reload Value Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CVR</name>
					<description>SysTick Current Value Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CURRENT</name>
							<description>Current Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CALIB</name>
					<description>SysTick Calibration Value Register r</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<resetValue>0xC0000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TENMS</name>
							<description>Ten Milliseconds Reload Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SKEW</name>
							<description>Ten Milliseconds Skewed</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>TENMS value is exact</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>TENMS value is inexact, or not given.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NOREF</name>
							<description>No Reference Clock</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>reference clock provided</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>no reference clock provided.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER0</name>
					<description>Interrupt Set-enable Register 0</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER1</name>
					<description>Interrupt Set-enable Register 1</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER2</name>
					<description>Interrupt Set-enable Register 2</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER3</name>
					<description>Interrupt Set-enable Register 3</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER0</name>
					<description>Interrupt Clear-enable Register 0</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER1</name>
					<description>Interrupt Clear-enable Register 1</description>
					<addressOffset>0x184</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER2</name>
					<description>Interrupt Clear-enable Register 2</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER3</name>
					<description>Interrupt Clear-enable Register 3</description>
					<addressOffset>0x18C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR0</name>
					<description>Interrupt Set-pending Register 0</description>
					<addressOffset>0x200</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR1</name>
					<description>Interrupt Set-pending Register 1</description>
					<addressOffset>0x204</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR2</name>
					<description>Interrupt Set-pending Register 2</description>
					<addressOffset>0x208</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR3</name>
					<description>Interrupt Set-pending Register 3</description>
					<addressOffset>0x20C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICPR0</name>
					<description>Interrupt Clear-pending Register 0</description>
					<addressOffset>0x280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICPR1</name>
					<description>Interrupt Clear-pending Register 1</description>
					<addressOffset>0x284</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
