alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4100.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="ERU0">
			<name>ERU1</name>
			<description>Event Request Unit 1</description>
			<groupName>ERU</groupName>
			<baseAddress>0x40044000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ERU1_0</name>
				<description>External Request Unit 1</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>ERU1_1</name>
				<description>External Request Unit 1</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>ERU1_2</name>
				<description>External Request Unit 1</description>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>ERU1_3</name>
				<description>External Request Unit 1</description>
				<value>8</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>GPDMA0</name>
			<description>General Purpose DMA Unit 0</description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x500142C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x3D40</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GPDMA0_0</name>
				<description>General Purpose DMA Unit 0</description>
				<value>105</value>
			</interrupt>
			<registers>
				<register>
					<name>RAWTFR</name>
					<description>Raw IntTfr Status</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Raw Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Raw Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Raw Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Raw Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWBLOCK</name>
					<description>Raw IntBlock Status</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Raw Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Raw Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Raw Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Raw Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWSRCTRAN</name>
					<description>Raw IntSrcTran Status</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Raw Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Raw Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Raw Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Raw Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWDSTTRAN</name>
					<description>Raw IntBlock Status</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Raw Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Raw Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Raw Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Raw Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWERR</name>
					<description>Raw IntErr Status</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Raw Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Raw Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Raw Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Raw Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSTFR</name>
					<description>IntTfr Status</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSBLOCK</name>
					<description>IntBlock Status</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSSRCTRAN</name>
					<description>IntSrcTran Status</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSDSTTRAN</name>
					<description>IntBlock Status</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSERR</name>
					<description>IntErr Status</description>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Interrupt Status for channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Interrupt Status for channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Interrupt Status for channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Interrupt Status for channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
