alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4100.svd
				<register>
					<name>GRXSTSP</name>
					<description>Receive Status Read and Pop Register</description>
					<addressOffset>0x0020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>EPNum</name>
							<description>Endpoint Number</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BCnt</name>
							<description>Byte Count</description>
							<lsb>4</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DPID</name>
							<description>Data PID</description>
							<lsb>15</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DATA0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DATA1</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DATA2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MDATA</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PktSts</name>
							<description>Packet Status</description>
							<lsb>17</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Global OUT NAK (triggers an interrupt)</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>OUT data packet received</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>OUT transfer completed (triggers an interrupt)</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>SETUP transaction completed (triggers an interrupt)</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>SETUP data packet received</description>
									<value>#0110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FN</name>
							<description>Frame Number</description>
							<lsb>21</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GRXFSIZ</name>
					<description>Receive FIFO Size Register</description>
					<addressOffset>0x0024</addressOffset>
					<size>32</size>
					<resetValue>0x0000011A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RxFDep</name>
							<description>RxFIFO Depth</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GNPTXFSIZ</name>
					<description>Non-Periodic Transmit FIFO Size Register</description>
					<addressOffset>0x0028</addressOffset>
					<size>32</size>
					<resetValue>0x0010011A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPTxF0StAddr</name>
							<description>IN Endpoint FIFO0 Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPTxF0Dep</name>
							<description>IN Endpoint TxFIFO 0 Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GUID</name>
					<description>USB Module Identification Register</description>
					<addressOffset>0x003C</addressOffset>
					<size>32</size>
					<resetValue>0x00B1C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GDFIFOCFG</name>
					<description>Global DFIFO Software Config Register</description>
					<addressOffset>0x005C</addressOffset>
					<size>32</size>
					<resetValue>0x027A02B2</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GDFIFOCfg</name>
							<description>GDFIFOCfg</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPInfoBaseAddr</name>
							<description>EPInfoBaseAddr</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF1</name>
					<description>Device IN Endpoint 1 Transmit FIFO Size Register</description>
					<addressOffset>0x0104</addressOffset>
					<size>32</size>
					<resetValue>0x0100012A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF2</name>
					<description>Device IN Endpoint 2 Transmit FIFO Size Register</description>
					<addressOffset>0x0108</addressOffset>
					<size>32</size>
					<resetValue>0x0100022A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF3</name>
					<description>Device IN Endpoint 3 Transmit FIFO Size Register</description>
					<addressOffset>0x010C</addressOffset>
					<size>32</size>
					<resetValue>0x0100032A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF4</name>
					<description>Device IN Endpoint 4 Transmit FIFO Size Register</description>
					<addressOffset>0x0110</addressOffset>
					<size>32</size>
					<resetValue>0x0100042A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF5</name>
					<description>Device IN Endpoint 5 Transmit FIFO Size Register</description>
					<addressOffset>0x0114</addressOffset>
					<size>32</size>
					<resetValue>0x0100052A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF6</name>
					<description>Device IN Endpoint 6 Transmit FIFO Size Register</description>
					<addressOffset>0x0118</addressOffset>
					<size>32</size>
					<resetValue>0x0100062A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCFG</name>
					<description>Device Configuration Register</description>
					<addressOffset>0x0800</addressOffset>
					<size>32</size>
					<resetValue>0x08200000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DevSpd</name>
							<description>Device Speed</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value4</name>
									<description>Full speed (USB 1.1 transceiver clock is 48 MHz)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NZStsOUTHShk</name>
							<description>Non-Zero-Length Status OUT Handshake</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Send a STALL handshake on a nonzero-length status OUT transaction and do not send the received OUT packet to the application.</description>
									<value>#1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Send the received OUT packet to the application (zero-length or nonzero-length) and send a handshake based on the NAK and STALL bits for the endpoint in the Device Endpoint Control register.</description>
									<value>#0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DevAddr</name>
							<description>Device Address</description>
							<lsb>4</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PerFrInt</name>
							<description>Periodic Frame Interval</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>80% of the frame interval</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>85%</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>90%</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>95%</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DescDMA</name>
							<description>Enable Scatter/Gather DMA in Device mode.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PerSchIntvl</name>
							<description>Periodic Scheduling Interval</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>25% of frame.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>50% of frame.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>75% of frame.</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DCTL</name>
					<description>Device Control Register</description>
					<addressOffset>0x0804</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RmtWkUpSig</name>
							<description>Remote Wakeup Signaling</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SftDiscon</name>
							<description>Soft Disconnect</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal operation. When this bit is cleared after a soft disconnect, the core drives a device connect event to the USB host. When the device is reconnected, the USB host restarts device enumeration.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The core drives a device disconnect event to the USB host.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GNPINNakSts</name>
							<description>Global Non-periodic IN NAK Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A handshake is sent out based on the data availability in the transmit FIFO.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A NAK handshake is sent out on all non-periodic IN endpoints, irrespective of the data availability in the transmit FIFO.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GOUTNakSts</name>
							<description>Global OUT NAK Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A handshake is sent based on the FIFO Status and the NAK and STALL bit settings.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>No data is written to the RxFIFO, irrespective of space availability. Sends a NAK handshake on all packets, except on SETUP transactions. All isochronous OUT packets are dropped.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SGNPInNak</name>
							<description>Set Global Non-periodic IN NAK</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGNPInNak</name>
							<description>Clear Global Non-periodic IN NAK</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SGOUTNak</name>
							<description>Set Global OUT NAK</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CGOUTNak</name>
							<description>Clear Global OUT NAK</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>GMC</name>
							<description>Global Multi Count</description>
							<lsb>13</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Invalid.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 packet.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 packets.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>3 packets.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IgnrFrmNum</name>
							<description>Ignore frame number for isochronous endpoints in case of Scatter/Gather DMA</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Scatter/Gather enabled: The core transmits the packets only in the frame number in which they are intended to be transmitted. Scatter/Gather disabled: Periodic transfer interrupt feature is disabled; the application must program transfers for periodic endpoints every frame</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Scatter/Gather enabled: The core ignores the frame number, sending packets immediately as the packets are ready. Scatter/Gather disabled: Periodic transfer interrupt feature is enabled; the application can program transfers for multiple frames for periodic endpoints.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NakOnBble</name>
							<description>Set NAK automatically on babble</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EnContOnBNA</name>
							<description>Enable continue on BNA</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>After receiving BNA interrupt, the core disables the endpoint. When the endpoint is re-enabled by the application, the core starts processing from the DOEPDMA descriptor.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>After receiving BNA interrupt, the core disables the endpoint. When the endpoint is re-enabled by the application, the core starts processing from the descriptor that received the BNA interrupt.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DSTS</name>
					<description>Device Status Register</description>
					<addressOffset>0x0808</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SuspSts</name>
							<description>Suspend Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EnumSpd</name>
							<description>Enumerated Speed</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value4</name>
									<description>Full speed (PHY clock is running at 48 MHz)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ErrticErr</name>
							<description>Erratic Error</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SOFFN</name>
							<description>Frame Number of the Received SOF</description>
							<lsb>8</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPMSK</name>
					<description>Device IN Endpoint Common Interrupt Mask Register</description>
					<addressOffset>0x0810</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferComplMsk</name>
							<description>Transfer Completed Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDisbldMsk</name>
							<description>Endpoint Disabled Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErrMsk</name>
							<description>AHB Error Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TimeOUTMsk</name>
							<description>Timeout Condition Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTknTXFEmpMsk</name>
							<description>IN Token Received When TxFIFO Empty Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNakEffMsk</name>
							<description>IN Endpoint NAK Effective Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxfifoUndrnMsk</name>
							<description>Fifo Underrun Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BNAInIntrMsk</name>
							<description>BNA Interrupt Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NAKMsk</name>
							<description>NAK interrupt Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
