alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4100.svd
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status Register</description>
					<addressOffset>0x0028</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0/1</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Trigger Set output</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trigger Set 1: TS16_SSIG, input sample signals</description>
									<value>#01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0/1 Bus Select</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trigger Set is output on OTGB0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trigger Set is output on OTGB1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TG_P</name>
							<description>TGS, TGB Write Protection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Will not suspend</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Hard suspend: Clock is switched off immediately.</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Soft suspend mode 0: Stop conversions after the currently running one is completed and its result has been stored. No change for the arbiter.</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Soft suspend mode 1: Stop conversions after the currently running one is completed and its result has been stored. Stop arbiter after the current arbitration round.</description>
									<value>#0011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Module is not (yet) suspended</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Module is suspended</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBCFG</name>
					<description>Global Configuration Register</description>
					<addressOffset>0x0080</addressOffset>
					<size>32</size>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVA</name>
							<description>Divider Factor for the Analog Internal Clock</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fADCI = fADC / 2</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fADCI = fADC / 2</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fADCI = fADC / 3</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fADCI = fADC / 32</description>
									<value>0x1F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCMSB</name>
							<description>Double Clock for the MSB Conversion</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 clock cycles for the MSB (standard)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 clock cycles for the MSB (fADCI &gt; 20 MHz)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVD</name>
							<description>Divider Factor for the Arbiter Clock</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fADCD = fADC</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fADCD = fADC / 2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fADCD = fADC / 3</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fADCD = fADC / 4</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVWC</name>
							<description>Write Control for Divider Parameters</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No write access to divider parameters</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfields DIVA, DCMSB, DIVD can be written</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPCAL0</name>
							<description>Disable Post-Calibration</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Automatic post-calibration after each conversion of group x</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>No post-calibration</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPCAL1</name>
							<description>Disable Post-Calibration</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Automatic post-calibration after each conversion of group x</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>No post-calibration</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPCAL2</name>
							<description>Disable Post-Calibration</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Automatic post-calibration after each conversion of group x</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>No post-calibration</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPCAL3</name>
							<description>Disable Post-Calibration</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Automatic post-calibration after each conversion of group x</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>No post-calibration</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUCAL</name>
							<description>Start-Up Calibration</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Initiate the start-up calibration phase (indication in bit GxARBCFG.CAL)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>GLOBICLASS[%s]</name>
					<description>Input Class Register, Global</description>
					<addressOffset>0x00A0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STCS</name>
							<description>Sample Time Control for Standard Conversions</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMS</name>
							<description>Conversion Mode for Standard Conversions</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>12-bit conversion</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>10-bit conversion</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>8-bit conversion</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>10-bit fast compare mode</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STCE</name>
							<description>Sample Time Control for EMUX Conversions</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CME</name>
							<description>Conversion Mode for EMUX Conversions</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>12-bit conversion</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>10-bit conversion</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>8-bit conversion</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>10-bit fast compare mode</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBBOUND</name>
					<description>Global Boundary Select Register</description>
					<addressOffset>0x00B8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BOUNDARY0</name>
							<description>Boundary Value 0 for Limit Checking</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BOUNDARY1</name>
							<description>Boundary Value 1 for Limit Checking</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBEFLAG</name>
					<description>Global Event Flag Register</description>
					<addressOffset>0x00E0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEVGLB</name>
							<description>Source Event (Background)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No source event</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A source event has occurred</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REVGLB</name>
							<description>Global Result Event</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No result event</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>New result was stored in register GLOBRES</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEVGLBCLR</name>
							<description>Clear Source Event (Background)</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clear the source event flag SEVGLB</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REVGLBCLR</name>
							<description>Clear Global Result Event</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clear the result event flag REVGLB</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBEVNP</name>
					<description>Global Event Node Pointer Register</description>
					<addressOffset>0x0140</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEV0NP</name>
							<description>Service Request Node Pointer Backgr. Source</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select shared service request line 0 of common service request group 0</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select shared service request line 3 of common service request group 0</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0 of common service request group 1</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3 of common service request group 1</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV0NP</name>
							<description>Service Request Node Pointer Backgr. Result</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select shared service request line 0 of common service request group 0</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select shared service request line 3 of common service request group 0</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0 of common service request group 1</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3 of common service request group 1</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBTF</name>
					<description>Global Test Functions Register</description>
					<addressOffset>0x0160</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CDGR</name>
							<description>Converter Diagnostics Group</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>All diagnostic pull devices are disconnected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Diagnostic pull devices connected as selected by bitfield CDSEL</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Connected to VAREF</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Connected to VAGND</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Connected to 1/3rd VAREF</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Connected to 2/3rd VAREF</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDWC</name>
							<description>Write Control for Conversion Diagnostics</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No write access to parameters</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfields CDSEL, CDEN, CDGR can be written</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disconnected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The pull-down diagnostics device is active</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MDWC</name>
							<description>Write Control for Multiplexer Diagnostics</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No write access to parameters</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfield PDD can be written</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
