alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4100.svd
				<register>
					<name>SDSV1</name>
					<description>Shadow reference value 1</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SDSV1</name>
							<description>Shadow DAC reference value 1</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SPC</name>
					<description>Shadow Pulse swallow value</description>
					<addressOffset>0x001C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SPSWV</name>
							<description>Shadow pulse swallow value</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC</name>
					<description>Comparator configuration</description>
					<addressOffset>0x0020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IBS</name>
							<description>External blanking trigger selector</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>HRPWMx.BLyA</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>HRPWMx.BLyB</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>HRPWMx.BLyC</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>HRPWMx.BLyD</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>HRPWMx.BLyE</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>HRPWMx.BLyF</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>HRPWMx.BLyG</description>
									<value>#0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>HRPWMx.BLyH</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>HRPWMx.BLyI</description>
									<value>#1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>HRPWMx.BLyJ</description>
									<value>#1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>HRPWMx.BLyK</description>
									<value>#1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>HRPWMx.BLyL</description>
									<value>#1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>HRPWMx.BLyM</description>
									<value>#1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>HRPWMx.BLyN</description>
									<value>#1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>HRPWMx.BLyO</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>HRPWMx.BLyP</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMCS</name>
							<description>Inverting comparator input selector</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>HRPWMx.CyINA</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>HRPWMx.CyINB</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMCC</name>
							<description>Comparator input switching configuration</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dynamic switch disabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Comparator input is connected to HRPWMx.CyINB when the control signal is HIGH</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Comparator input is connected to HRPWMx.CyINA when the control signal is HIGH</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESE</name>
							<description>External triggered switch enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OIE</name>
							<description>Comparator output inversion enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OSE</name>
							<description>Comparator output synchronization enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BLMC</name>
							<description>Blanking mode</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Blanking disabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Blanking on a LOW to HIGH transition</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Blanking on a HIGH to LOW transition</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Blanking on both transitions</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EBE</name>
							<description>External blanking trigger enabled</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>COFE</name>
							<description>Comparator output filter enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Filtering stage disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Filtering stage enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COFM</name>
							<description>Comparator output filter window</description>
							<lsb>18</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Comparator Output needs to be stable for 2 clock cycles</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Comparator Output needs to be stable for 3 clock cycles</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Comparator Output needs to be stable for 4 clock cycles</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Comparator Output needs to be stable for 5 clock cycles</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Comparator Output needs to be stable for 14 clock cycles</description>
									<value>#1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Comparator Output needs to be stable for 15 clock cycles</description>
									<value>#1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Comparator Output needs to be stable for 16 clock cycles</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Comparator Output needs to be stable for 32 clock cycles</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COFC</name>
							<description>Comparator output filter control</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Filtering is always done if enabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Filtering is only done when CSGyDSV1 value is currently fed to the DAC</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Filtering is only done when the CSGyDSV2 value is currently fed to the DAC</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PLC</name>
					<description>Passive level configuration</description>
					<addressOffset>0x0024</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IPLS</name>
							<description>Clamping control signal selector</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>HRPWMx.BLyA</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>HRPWMx.BLyB</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>HRPWMx.BLyC</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>HRPWMx.BLyD</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>HRPWMx.BLyE</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>HRPWMx.BLyF</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>HRPWMx.BLyG</description>
									<value>#0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>HRPWMx.BLyH</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>HRPWMx.BLyI</description>
									<value>#1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>HRPWMx.BLyJ</description>
									<value>#1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>HRPWMx.BLyK</description>
									<value>#1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>HRPWMx.BLyL</description>
									<value>#1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>HRPWMx.BLyM</description>
									<value>#1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>HRPWMx.BLyN</description>
									<value>#1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>HRPWMx.BLyO</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>HRPWMx.BLyP</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLCL</name>
							<description>Clamping control signal level selection</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Clamping control disabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output is set to clamped level when the control signal is HIGH</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Output is set to clamped level when the control signal is LOW</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSL</name>
							<description>Output passive level value</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output clamped level is LOW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output clamped level is HIGH</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLSW</name>
							<description>Clamped state exit SW configuration</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External signal and SW can remove the output from the clamped state</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Only SW can remove the output from the clamped state</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLEC</name>
							<description>Passive level enter configuration</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Passive level is entered immediately</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Passive level is entered only after the comparator output passes to LOW (output from the blanking stage)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Passive level is entered only after the comparator output passes to HIGH (output from the blanking stage)</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLXC</name>
							<description>Passive level exit configuration</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Passive level is exit immediately</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Passive level is exit only after the comparator output passes to LOW (output from the blanking stage)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Passive level is exit only after the comparator output passes to HIGH (output from the blanking stage)</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BLV</name>
					<description>Comparator blanking value</description>
					<addressOffset>0x0028</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BLV</name>
							<description>Blanking value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRE</name>
					<description>Service request enable</description>
					<addressOffset>0x002C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VLS1E</name>
							<description>Value switch from CSGyDSV1 to CSGyDSV2 interrupt enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VLS2E</name>
							<description>Value switch from CSGyDSV2 to CSGyDSV1 interrupt enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRGSE</name>
							<description>Conversion trigger interrupt enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STRSE</name>
							<description>Start trigger interrupt enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STPSE</name>
							<description>Stop trigger interrupt enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STDE</name>
							<description>Shadow transfer done interrupt enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRSE</name>
							<description>Comparator rise interrupt enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CFSE</name>
							<description>Comparator fall interrupt enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSEE</name>
							<description>Clamped state interrupt enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
